FKDD_COPY_DIFF_3_2026-02-13/Documents/ПодтверждениеВозмещенияПоставщиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПодтверждениеВозмещенияПоставщиком</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.ОтветПоставщикаПоВозмещениям</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТ_ОстаткиВозмещений</xr:Item>
				<xr:Item>AccumulationRegister.ТТ_ОстаткиОплатВозмещений</xr:Item>
				<xr:Item>InformationRegister.тт_Возмещения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтветПоставщикаПоВозмещениям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаВозмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПрограмм</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидокНаАвтомобиль</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозмещенияВсебестоимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ПодтверждениеВозмещенияПоставщиком/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ХозОперация=Справочники.ХозОперации.ПодтверждениеПоставщикомВозмещения;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыСведений.тт_Возмещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	
	Для каждого Стр из Скидки Цикл
		
		Если обЗначениеНеЗаполнено(Стр.Автомобиль) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Автомобиль! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Стр.Скидка) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Тип скидки! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Если Стр.Скидка.Организация <> Организация Тогда
			
			Сообщить("Организация документа не соответствует Организации программы возмещения "+Стр.Скидка+". Автомобиль "+Стр.Автомобиль);
			
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		////Проверка, на наличие сумм к подтверждению
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	СУММА(ТТ_ОстаткиВозмещенийОстатки.СуммаКПодтверждениюОстаток) КАК СуммаКПодтверждениюОстаток
		//|ИЗ
		//|	РегистрНакопления.ТТ_ОстаткиВозмещений.Остатки(
		//|			&Момент,
		//|			Автомобиль = &Автомобиль
		//|				И ТипСкидки = &ТипСкидки) КАК ТТ_ОстаткиВозмещенийОстатки";
		//
		//Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
		//Запрос.УстановитьПараметр("Момент", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
		//Запрос.УстановитьПараметр("ТипСкидки", Стр.Скидка);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//Если РезультатЗапроса.Пустой() ИЛИ РезультатЗапроса.Выгрузить()[0].СуммаКПодтверждениюОстаток = 0 Тогда
		//	Сообщить("Нет остатков сумм к подтверждению по программе "+Стр.Скидка+". Автомобиль: "+Стр.Автомобиль);
		//	Отказ=Истина;
		//	Продолжить;
		//КонецЕсли;
						
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Автомобиль = Стр.Автомобиль;
		НоваяЗапись.СтатусВозмещения = Справочники.ТТ_СтатусыВозмещений.Подтверждение;
		НоваяЗапись.Скидка = Стр.Скидка;
		НоваяЗапись.Период = Ссылка.Дата;
		НоваяЗапись.СуммаВозмещения = Стр.Сумма;
		НоваяЗапись.СуммаНДС = Стр.СуммаНДС;
		
		//Движения.ТТ_ОстаткиВозмещений.Записывать=Истина;
		//
		//Движ=Движения.ТТ_ОстаткиВозмещений.Добавить();
		//Движ.Период=ЭтотОбъект.Дата;
		//дВиж.ВидДвижения=ВидДвиженияНакопления.Расход;
		//Движ.Автомобиль=Стр.Автомобиль;
		//Движ.Поставщик = Стр.Скидка.Контрагент;
		//Движ.ТипСкидки=Стр.Скидка;
		//Движ.СуммаКПодтверждению=Стр.Сумма;
		//Движ.СуммаНДСКПодтверждению=Стр.СуммаНДС;
		
		// БизТех Горковенко П.А. 12.11.25 ++
		//Проверка, на наличие необходимости оплаты
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ТТ_ОстаткиОплатВозмещенийОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТТ_ОстаткиОплатВозмещений.Остатки(
		|			&Момент,
		|			Автомобиль = &Автомобиль
		|				И ТипСкидки = &ТипСкидки) КАК ТТ_ОстаткиОплатВозмещенийОстатки";
		
		Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
		Запрос.УстановитьПараметр("Момент", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ТипСкидки", Стр.Скидка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() ИЛИ РезультатЗапроса.Выгрузить()[0].Суммаостаток = 0 Тогда
			Сообщить("Нет остатков сумм к оплате по программе "+Стр.Скидка+". Автомобиль: "+Стр.Автомобиль);
			Отказ=Истина;
			Продолжить;
		КонецЕсли; 
		
				
		Если РезультатЗапроса.Выгрузить()[0].Суммаостаток < Стр.Сумма Тогда  
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сумма оплаты подтверждения (" + Стр.Сумма + ") превышает допустимую ("+ РезультатЗапроса.Выгрузить()[0].Суммаостаток + "). Проверьте данные!";   
			Сообщение.Сообщить();  
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		// БизТех Горковенко П.А. 12.11.25 --
		
		//Оплаты возмещений
		Движения.ТТ_ОстаткиОплатВозмещений.Записывать=Истина;	
		Движ=Движения.ТТ_ОстаткиОплатВозмещений.Добавить();
		Движ.Период=ЭтотОбъект.Дата; 
		// дВиж.ВидДвижения=ВидДвиженияНакопления.Приход;   Бизтех Горковенко П.А. 10.11.2025
		дВиж.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движ.Автомобиль=Стр.Автомобиль;
		Движ.ТипСкидки=Стр.Скидка;
		Движ.Сумма=Стр.Сумма;
		Движ.СуммаНДС=Стр.СуммаНДС;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(ИСТИНА);

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ХозОперация=Справочники.ХозОперации.ПодтверждениеПоставщикомВозмещения;
	
	Дата = ТекущаяДата();
	
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") 
	//	ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаДолга") 
	//	Тогда
	//	// Заполнение шапки
	//	Комментарий = ДанныеЗаполнения.Комментарий;
	//	Поставщик = ДанныеЗаполнения.Контрагент;
	//	Организация = ДанныеЗаполнения.Организация;
	//	ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
	//	ДокументОснование = ДанныеЗаполнения.Ссылка; 
	
		//Для Каждого ТекСтрокаАвтомобили Из ДанныеЗаполнения.Автомобили Цикл
		//	НоваяСтрока = Скидки.Добавить();
		//	НоваяСтрока.Автомобиль = ТекСтрокаАвтомобили.Автомобиль;
		//КонецЦикла; 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтветПоставщикаПоВозмещениям")   
		Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		//Контрагент = ДанныеЗаполнения.ПрограммаВозмещения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование=ДанныеЗаполнения.Ссылка;  
		//ПрограммаВозмещения = ДанныеЗаполнения.ПрограммаВозмещения; 
		СписокПрограмм = ДанныеЗаполнения.СписокПрограмм;//БизТех Горковенко П.А. 30.11.25++
		
		ЗначенияКонтрагентов = Новый СписокЗначений;   
		ДанныеСпискаПрограмм = СписокПрограмм.Получить();
		Для Каждого СтрокаПрограммы Из ДанныеСпискаПрограмм Цикл
			ЗначенияКонтрагентов.Добавить(СтрокаПрограммы.Значение.Контрагент);	
		КонецЦикла; 
		СписокКонтрагентов = Новый ХранилищеЗначения(ЗначенияКонтрагентов);
		Данные = СписокКонтрагентов.Получить();
		
		
		Для Каждого ТекСтрокаСкидки Из ДанныеЗаполнения.Скидки Цикл
			НоваяСтрока = Скидки.Добавить();
			НоваяСтрока.Автомобиль = ТекСтрокаСкидки.Автомобиль;
			НоваяСтрока.Комментарий = ТекСтрокаСкидки.Комментарий;
			НоваяСтрока.Скидка = ТекСтрокаСкидки.Скидка;
			НоваяСтрока.СтавкаНДС = ТекСтрокаСкидки.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаСкидки.СуммаВозмещения;
			НоваяСтрока.СуммаНДС = ТекСтрокаСкидки.СуммаНДС;
		КонецЦикла;
		
	КонецЕсли;
	
	Автор=ПараметрыСеанса.Пользователь;
	
КонецПроцедуры
